In [1]:
a=(1,2,3)

In [2]:
list(a)

[1, 2, 3]

In [15]:
name = ['able','ken','patti']
name_2 = enumerate(name)

In [12]:
print(name_2)

<enumerate object at 0x10792aaa0>

In [13]:
print(list(name_2))

[(0, 'able'), (1, 'ken'), (2, 'patti')]

In [16]:
for x,y in name_2:
    print(x,y)

0 able
1 ken
2 patti

In [18]:
name = ['able','ken','patti']
age = [22,24,25]

comb = zip(name,age)

In [19]:
list(comb)

[('able', 22), ('ken', 24), ('patti', 25)]

In [23]:
name = ['able','ken','patti']
age = [22,24,25]

comb = zip(name,age)

In [21]:
print(*comb)

('able', 22) ('ken', 24) ('patti', 25)

In [24]:
for x,y in comb:
    print(x,y)

able 22
ken 24
patti 25

In [40]:
import pandas as pd

order = pd.read_csv('orders.csv', chunksize = 1000)
orders = pd.read_csv('orders.csv')
orders.head()

,customer,products,sales_person,sales_region,sales_date,quarter,sales,costs
0,LONG ISLANDS INC,SOFT DRINKS,Michael Jackson,AMERICAS,4/13/12,Q2,24640,16999
1,LONG ISLANDS INC,SOFT DRINKS,Michael Jackson,AMERICAS,12/21/12,Q4,24640,13059
2,LONG ISLANDS INC,SOFT DRINKS,Michael Jackson,AMERICAS,12/24/12,Q4,29923,13826
3,LONG ISLANDS INC,SOFT DRINKS,Michael Jackson,AMERICAS,12/24/12,Q4,66901,18658
4,LONG ISLANDS INC,SOFT DRINKS,Michael Jackson,AMERICAS,12/29/12,Q4,63116,19949

In [41]:
chunk_sum = []
for x in order:
    chunk_sum.append(sum(x['sales']))

In [43]:
total = sum(chunk_sum)

In [44]:
print(total)

32062645